Config/Reports/АнализЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>АнализЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженностиИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженностиИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПодвал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДатамИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомИсправленияОшибокПрошлыхЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаИсправленияОшибокПрошлыхЛет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Enums/ВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Reports/АнализЗадолженности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.Печать.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидЗадолженностиИспользование Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЗадолженности");
	КонецЕсли;
	Если ТипЗадолженностиИспользование Тогда
		ПроверяемыеРеквизиты.Добавить("ТипЗадолженности");
	КонецЕсли;
	
	Если ВидЗадолженностиИспользование И ЗначениеЗаполнено(ВидЗадолженности)
		И ТипЗадолженностиИспользование И ЗначениеЗаполнено(ТипЗадолженности) Тогда
		
		ТекстОшибки = "";
		Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская
			И (ТипЗадолженности = "Кт205" ИЛИ ТипЗадолженности = "Кт208" ИЛИ ТипЗадолженности = "Кт301" ИЛИ ТипЗадолженности = "Кт302" ИЛИ ТипЗадолженности = "Кт30401") Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выбранный тип ""%1"" не относится к дебиторской задолженности.'"),
					Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление(ТипЗадолженности));
			
		ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская
			И (ТипЗадолженности = "Дт205" ИЛИ ТипЗадолженности = "Дт206" ИЛИ ТипЗадолженности = "Дт207" ИЛИ ТипЗадолженности = "Дт208") Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выбранный тип ""%1"" не относится к кредиторской задолженности.'"),
					Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление(ТипЗадолженности));
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Отчет.ТипЗадолженности",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Установим параметры основной СКД.
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "НаДату", ДатаОтчета, Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "Организация", Организация, Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "СчетаОстатков",
		БухгалтерскийУчет.СписокСчетов(КонтрольИсполненияДоговоровКлиентСервер.СчетаРасчетовСВедениемГрафиковПоДоговорам()), Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "Счета205и209",
		БухгалтерскийУчет.СписокСчетов("205.00,209.00"), Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "Счета302",
		БухгалтерскийУчет.СписокСчетов("302.00"), Истина);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "ВалютаРеглУчета",
		БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета(), Истина);
	
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "КонтрагентыДоговоры", СубконтоКонтрагентыДоговоры, Истина);
	
	Для Каждого НастройкаСКД Из Настройки.Структура Цикл
		Если НастройкаСКД.Имя = "ОбычныйРежим" Тогда
			НастройкаСКД.Использование = НЕ РежимРасшифровки;
		ИначеЕсли НастройкаСКД.Имя = "РежимРасшифровки" Тогда
			НастройкаСКД.Использование = РежимРасшифровки;
		КонецЕсли;
		Если ТипЗнч(НастройкаСКД) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для Каждого СтрокаТаблицы Из НастройкаСКД.Строки Цикл
				УстановитьДетализациюПоДатамИсполнения(СтрокаТаблицы, ПоДатамИсполнения);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ВывестиЗаголовокОтчета(ДокументРезультат, Настройки);
	
	// вывод отчета
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Отбор.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Договор) Тогда
		Отбор.Вставить("Договор", Договор);
	КонецЕсли;
	
	ПараметрСчетРасчетов = Настройки.ПараметрыДанных.Элементы.Найти("СчетРасчетов");
	ПараметрИФО          = Настройки.ПараметрыДанных.Элементы.Найти("ИФО");
	ПараметрКФО          = Настройки.ПараметрыДанных.Элементы.Найти("КФО");
	ПараметрКПС          = Настройки.ПараметрыДанных.Элементы.Найти("КПС");
	Если ПараметрСчетРасчетов <> Неопределено И ПараметрСчетРасчетов.Использование Тогда
		Отбор.Вставить("СчетРасчетов", ПараметрСчетРасчетов.Значение);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ПараметрИФО <> Неопределено И ПараметрИФО.Использование Тогда
		Отбор.Вставить("ИФО", ПараметрИФО.Значение);
	КонецЕсли;
	Если ПараметрКФО <> Неопределено И ПараметрКФО.Использование Тогда
		Отбор.Вставить("КФО", ПараметрКФО.Значение);
	КонецЕсли;
	Если ПараметрКПС <> Неопределено И ПараметрКПС.Использование Тогда
		Отбор.Вставить("КПС", ПараметрКПС.Значение);
	КонецЕсли;
	
	ПараметрыАнализаЗадолженности = КонтрольИсполненияДоговоров.НовыеПараметрыАнализаЗадолженности();
	ПараметрыАнализаЗадолженности.ЗаполнятьСУчетомИсправленияОшибокПрошлыхЛет = СУчетомИсправленияОшибокПрошлыхЛет;
	ПараметрыАнализаЗадолженности.КонецПериодаИсправленияОшибокПрошлыхЛет = КонецПериодаИсправленияОшибокПрошлыхЛет;
	
	ВнешниеНаборыДанных.Вставить("АнализЗадолженности",
		КонтрольИсполненияДоговоров.АнализЗадолженности(Организация, ДатаОтчета, Отбор,
			?(ВидЗадолженностиИспользование, ВидЗадолженности, Неопределено),
			?(ТипЗадолженностиИспользование, ТипЗадолженности, Неопределено),
			ПараметрыАнализаЗадолженности));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// подпись
	
	ВывестиПодвалОтчета(ДокументРезультат, Настройки);
	
	ДокументРезультат.ФиксацияСлева = 1;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиЗаголовокОтчета(Результат, Настройки)
	
	МакетЗаголовка = УправлениеПечатью.МакетПечатнойФормы("Отчет.АнализЗадолженности.ПФ_MXL_ЗаголовокОтчета");
	
	Если ЭтотОбъект.ВыводитьЗаголовок Тогда
		
		// Заголовок.
		ОбластьЗаголовка = МакетЗаголовка.ПолучитьОбласть("Заголовок");
		ПараметрыЗаголовка = Новый Структура;
		ПараметрыЗаголовка.Вставить("ЗаголовокОтчета", НСтр("ru = 'Анализ задолженности'")
			+ ?(ПоДатамИсполнения, НСтр("ru = ' (по датам исполнения)'"), ""));
		ОбластьЗаголовка.Параметры.Заполнить(ПараметрыЗаголовка);
		Результат.Вывести(ОбластьЗаголовка);
		
		ОбластьНаДату = МакетЗаголовка.ПолучитьОбласть("НаДату");
		ОбластьНаДату.Параметры.ЗаголовокНаДату = Формат(ДатаОтчета, "ДЛФ=ДД");
		Результат.Вывести(ОбластьНаДату);
		
		// Шапка.
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Наименование,НаименованиеСокращенное");
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Наименование,НаименованиеСокращенное");
		
		ОбластьШапка = МакетЗаголовка.ПолучитьОбласть("Шапка");
		ПараметрыШапка = Новый Структура("НаименованиеОрганизации,КонтрагентДоговор");
		ПараметрыШапка.НаименованиеОрганизации =
			?(ЗначениеЗаполнено(РеквизитыОрганизации.НаименованиеСокращенное),
			РеквизитыОрганизации.НаименованиеСокращенное,
			РеквизитыОрганизации.Наименование);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ПараметрыШапка.КонтрагентДоговор =
				?(ЗначениеЗаполнено(РеквизитыКонтрагента.НаименованиеСокращенное),
				РеквизитыКонтрагента.НаименованиеСокращенное,
				РеквизитыКонтрагента.Наименование)
				+ ?(ЗначениеЗаполнено(Договор), ", " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Наименование"), "");
		Иначе
			ПараметрыШапка.КонтрагентДоговор = "Без отбора";
		КонецЕсли;
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапка);
		Результат.Вывести(ОбластьШапка);
		
	КонецЕсли;
	
	// Отборы.
	ТекстОтбора = "";
	Для каждого ПараметрДанных Из Настройки.ПараметрыДанных.Элементы Цикл
	
		Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ПараметрДанных.Использование Тогда
			
			Если НЕ ЗначениеЗаполнено(ПараметрДанных.ИдентификаторПользовательскойНастройки) Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 Равно ""%2""'"),
				Строка(ПараметрДанных.Параметр), Строка(ПараметрДанных.Значение));
			ТекстОтбора = ТекстОтбора + ?(ПустаяСтрока(ТекстОтбора), "", ", ") + ПредставлениеОтбора;
			
		КонецЕсли;
	
	КонецЦикла;
	Для каждого ТекСтрОтбора Из Настройки.Отбор.Элементы Цикл
	
		Если ТипЗнч(ТекСтрОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ТекСтрОтбора.Использование
			И НЕ ТекСтрОтбора.РежимОтображения <> РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ Тогда
			
			Если ЗначениеЗаполнено(ТекСтрОтбора.ИдентификаторПользовательскойНастройки) 
				И ТекСтрОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 ""%3""'"),
				Строка(ТекСтрОтбора.ЛевоеЗначение), Строка(ТекСтрОтбора.ВидСравнения), Строка(ТекСтрОтбора.ПравоеЗначение));
			ТекстОтбора = ТекстОтбора + ?(ПустаяСтрока(ТекстОтбора), "", ", ") + ПредставлениеОтбора;
			
		КонецЕсли;
	
	КонецЦикла;
	Если НЕ ПустаяСтрока(ТекстОтбора) Тогда
		ОбластьОтбор = МакетЗаголовка.ПолучитьОбласть("Отбор");
		ОбластьОтбор.Параметры.ТекстОтбора = ТекстОтбора;
		Результат.Вывести(ОбластьОтбор);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПодвалОтчета(Результат, Настройки)
	
	Если ЭтотОбъект.ВыводитьПодвал Тогда
		СтандартныеОтчеты.ВывестиПодвалОтчета(ЭтотОбъект, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДетализациюПоДатамИсполнения(СтрокаТаблицы, Знач ВклОткл)
	
	Для Каждого ЭлементСтруктуры Из СтрокаТаблицы.Структура Цикл
		
		Если ЭлементСтруктуры.Структура.Количество() > 0 Тогда
			// Рекурсивный вызов для вложенных элементов структуры.
			УстановитьДетализациюПоДатамИсполнения(ЭлементСтруктуры, ВклОткл);
		КонецЕсли;
		
		Если СтрНайти(ЭлементСтруктуры.Имя, "СрокИсполнения") > 0 Тогда
			ЭлементСтруктуры.Использование = ВклОткл;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
